zuyih/platform-ststm32/misc/svd/STM32H5E5.svd
        <register>
          <name>FLASH_OPTSR_PRG</name>
          <displayName>FLASH_OPTSR_PRG</displayName>
          <description>FLASH option status register</description>
          <addressOffset>0x054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option configuration bit
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>BOR Level 2, the threshold level is medium (around 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>BOR Level 3, the threshold level is high (around 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BORH_EN</name>
              <description>Brownout high enable configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option configuration bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>IWDG watchdog is controlled by hardware</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>IWDG watchdog is controlled by software</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>WWDG control mode option configuration bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WWDG watchdog is controlled by hardware</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WWDG watchdog is controlled by software</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>Core domain Stop entry reset option configuration bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>a reset is generated when entering Stop mode on core domain</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>no reset generated when entering Stop mode on core domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRST_STDBY</name>
              <description>Core domain Standby entry reset option configuration bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>a reset is generated when entering Standby mode on core domain</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>no reset generated when entering Standby mode on core domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRODUCT_STATE</name>
              <description>Life state code (based on Hamming 8,4).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_VDD_HSLV</name>
              <description>High-speed IO at low VDD voltage configuration bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>High-speed IO at low Vless thansub&gt;DDless than/sub&gt; voltage feature disabled (Vless thansub&gt;DDless than/sub&gt; can exceed 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>High-speed IO at low Vless thansub&gt;DDless than/sub&gt; voltage feature enabled (Vless thansub&gt;DDless than/sub&gt; remains below 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_VDDIO2_HSLV</name>
              <description>High-speed IO at low Vless thansub&gt;DDIO2less than/sub&gt; voltage configuration bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>High-speed IO at low Vless thansub&gt;DDIO2less than/sub&gt; voltage feature disabled (Vless thansub&gt;DDIO2less than/sub&gt; can exceed 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>High-speed IO at low Vless thansub&gt;DDIO2less than/sub&gt; voltage feature enabled (Vless thansub&gt;DDIO2less than/sub&gt; remains below 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>IWDG Stop mode freeze option status bit
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Independent watchdog frozen in system Stop mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Independent watchdog keep running in system Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDG_STDBY</name>
              <description>IWDG Standby mode freeze option status bit
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Independent watchdog frozen in Standby mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Independent watchdog keep running in Standby mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_UBE</name>
              <description>Available only on cryptography enabled devices.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>ST-iRoT (system flash) selected</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>OEM-iRoT (user flash) selected.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP_BANK</name>
              <description>Bank swapping option configuration bit
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Bank1 and bank2 not swapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Bank1 and bank2 swapped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NSEPOCHR_CUR</name>
          <displayName>FLASH_NSEPOCHR_CUR</displayName>
          <description>FLASH nonsecure EPOCH register</description>
          <addressOffset>0x060</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NS_EPOCH</name>
              <description>Non-volatile nonsecure EPOCH counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECEPOCHR_CUR</name>
          <displayName>FLASH_SECEPOCHR_CUR</displayName>
          <description>FLASH secure EPOCH register</description>
          <addressOffset>0x068</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SEC_EPOCH</name>
              <description>Non-volatile secure EPOCH counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OPTSR2_CUR</name>
          <displayName>FLASH_OPTSR2_CUR</displayName>
          <description>FLASH option status register 2</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SRAM1_3_4_5_RST</name>
              <description>SRAM1, SRAM3, SRAM4, and SRAM5 erase upon system reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM1, SRAM3, SRAM4, and SRAM5 erased when a system reset occurs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM1, SRAM3, SRAM4, and SRAM5 not erased when a system reset occurs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_RST</name>
              <description>SRAM2 erase when system reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 erased when a system reset occurs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 not erased when a system reset occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BKPRAM_ECC</name>
              <description>Backup RAM ECC detection and correction disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>BKPRAM ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>BKPRAM ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3_ECC</name>
              <description>SRAM3 ECC detection and correction disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM3 ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM3 ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_ECC</name>
              <description>SRAM2 ECC detection and correction disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPD_DIS</name>
              <description>USB power delivery configuration option bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HUK_PUF</name>
              <description>This bit select the source of the HUK sent to the SAES.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Source is RHUK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Source is PUF</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZEN</name>
              <description>TrustZone enable configuration bits
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>TrustZone disabled</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>TrustZone enabled.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
