zuyih/platform-ststm32/misc/svd/STM32H5E5.svd
        <register>
          <name>FLASH_PRIVBB2R5</name>
          <displayName>FLASH_PRIVBB2R5</displayName>
          <description>FLASH privilege block-based register for bank2</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB2</name>
              <description>Privileged / non-privileged 8-Kbyte flash bank2 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in bank2 is unprivileged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in bank2 is privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB2R6</name>
          <displayName>FLASH_PRIVBB2R6</displayName>
          <description>FLASH privilege block-based register for bank2</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB2</name>
              <description>Privileged / non-privileged 8-Kbyte flash bank2 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in bank2 is unprivileged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in bank2 is privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB2R7</name>
          <displayName>FLASH_PRIVBB2R7</displayName>
          <description>FLASH privilege block-based register for bank2</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB2</name>
              <description>Privileged / non-privileged 8-Kbyte flash bank2 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in bank2 is unprivileged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in bank2 is privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB2R8</name>
          <displayName>FLASH_PRIVBB2R8</displayName>
          <description>FLASH privilege block-based register for bank2</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB2</name>
              <description>Privileged / non-privileged 8-Kbyte flash bank2 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in bank2 is unprivileged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in bank2 is privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R_CUR</name>
          <displayName>FLASH_SECWM2R_CUR</displayName>
          <description>FLASH security watermark for bank2</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM2_STRT</name>
              <description>Bank2 security WM area start sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECWM2_END</name>
              <description>Bank2 security WM end sector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R_PRG</name>
          <displayName>FLASH_SECWM2R_PRG</displayName>
          <description>FLASH security watermark for bank2</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM2_STRT</name>
              <description>Bank2 security WM area start sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM2_END</name>
              <description>Bank2 security WM area end sector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP21R_CUR</name>
          <displayName>FLASH_WRP21R_CUR</displayName>
          <description>FLASH write sector group 1 protection for bank2</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>WRPSG21</name>
              <description>Bank2 sector group 1 protection option status byte
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP21R_PRG</name>
          <displayName>FLASH_WRP21R_PRG</displayName>
          <description>FLASH write sector group 1 protection for bank2</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>WRPSG21</name>
              <description>Bank2 sector group 1 protection option status byte
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_EDATA2R_CUR</name>
          <displayName>FLASH_EDATA2R_CUR</displayName>
          <description>FLASH data sectors configuration bank2</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>EDATA2_STRT</name>
              <description>EDATA2_STRT contains the start sectors of the flash high-cycle data area in bank2 There is no hardware effect to those bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The last sector of bank2 is reserved for flash high-cycle data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The two last sectors of bank2 are reserved for flash high-cycle data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>The three last sectors of bank2 are reserved for flash high-cycle data</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDATA2_EN</name>
              <description>Bank2 flash high-cycle data enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No flash high-cycle data area</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Flash high-cycle data is used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_EDATA2R_PRG</name>
          <displayName>FLASH_EDATA2R_PRG</displayName>
          <description>FLASH data sector configuration bank2</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>EDATA2_STRT</name>
              <description>EDATA2_STRT contains the start sectors of the flash high-cycle data area in bank2 There is no hardware effect to those bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>The last sector of bank2 is reserved for flash high-cycle data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>The two last sectors of bank2 are reserved for flash high-cycle data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>The three last sectors of bank2 are reserved for flash high-cycle data</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDATA2_EN</name>
              <description>bank2 flash high-cycle data enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No flash high-cycle data area</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Flash high-cycle data is used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_HDP2R_CUR</name>
          <displayName>FLASH_HDP2R_CUR</displayName>
          <description>FLASH HDP bank2 configuration</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HDP2_STRT</name>
              <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDP2_END</name>
              <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_HDP2R_PRG</name>
          <displayName>FLASH_HDP2R_PRG</displayName>
          <description>FLASH HDP bank2 configuration</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HDP2_STRT</name>
              <description>HDPL barrier start set in number of 8-Kbyte sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP2_END</name>
              <description>HDPL barrier end set in number of 8-Kbyte sectors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
