zuyih/platform-ststm32/misc/svd/STM32H5E5.svd
        <register>
          <name>JPEG_HUFFENC_AC0_47</name>
          <displayName>JPEG_HUFFENC_AC0_47</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE94</name>
              <description>Huffman code 94
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN94</name>
              <description>Huffman length 94
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE95</name>
              <description>Huffman code 95
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN95</name>
              <description>Huffman length 95
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_48</name>
          <displayName>JPEG_HUFFENC_AC0_48</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE96</name>
              <description>Huffman code 96
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN96</name>
              <description>Huffman length 96
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE97</name>
              <description>Huffman code 97
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN97</name>
              <description>Huffman length 97
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_49</name>
          <displayName>JPEG_HUFFENC_AC0_49</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE98</name>
              <description>Huffman code 98
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN98</name>
              <description>Huffman length 98
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE99</name>
              <description>Huffman code 99
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN99</name>
              <description>Huffman length 99
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_50</name>
          <displayName>JPEG_HUFFENC_AC0_50</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE100</name>
              <description>Huffman code 100
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN100</name>
              <description>Huffman length 100
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE101</name>
              <description>Huffman code 101
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN101</name>
              <description>Huffman length 101
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_51</name>
          <displayName>JPEG_HUFFENC_AC0_51</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE102</name>
              <description>Huffman code 102
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN102</name>
              <description>Huffman length 102
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE103</name>
              <description>Huffman code 103
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN103</name>
              <description>Huffman length 103
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_52</name>
          <displayName>JPEG_HUFFENC_AC0_52</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE104</name>
              <description>Huffman code 104
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN104</name>
              <description>Huffman length 104
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE105</name>
              <description>Huffman code 105
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN105</name>
              <description>Huffman length 105
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_53</name>
          <displayName>JPEG_HUFFENC_AC0_53</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE106</name>
              <description>Huffman code 106
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN106</name>
              <description>Huffman length 106
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE107</name>
              <description>Huffman code 107
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN107</name>
              <description>Huffman length 107
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_54</name>
          <displayName>JPEG_HUFFENC_AC0_54</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE108</name>
              <description>Huffman code 108
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN108</name>
              <description>Huffman length 108
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE109</name>
              <description>Huffman code 109
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN109</name>
              <description>Huffman length 109
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_55</name>
          <displayName>JPEG_HUFFENC_AC0_55</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE110</name>
              <description>Huffman code 110
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN110</name>
              <description>Huffman length 110
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE111</name>
              <description>Huffman code 111
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN111</name>
              <description>Huffman length 111
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_56</name>
          <displayName>JPEG_HUFFENC_AC0_56</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE112</name>
              <description>Huffman code 112
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN112</name>
              <description>Huffman length 112
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE113</name>
              <description>Huffman code 113
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN113</name>
              <description>Huffman length 113
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_57</name>
          <displayName>JPEG_HUFFENC_AC0_57</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE114</name>
              <description>Huffman code 114
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN114</name>
              <description>Huffman length 114
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE115</name>
              <description>Huffman code 115
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN115</name>
              <description>Huffman length 115
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_58</name>
          <displayName>JPEG_HUFFENC_AC0_58</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE116</name>
              <description>Huffman code 116
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN116</name>
              <description>Huffman length 116
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE117</name>
              <description>Huffman code 117
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN117</name>
              <description>Huffman length 117
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_59</name>
          <displayName>JPEG_HUFFENC_AC0_59</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE118</name>
              <description>Huffman code 118
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN118</name>
              <description>Huffman length 118
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE119</name>
              <description>Huffman code 119
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN119</name>
              <description>Huffman length 119
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_60</name>
          <displayName>JPEG_HUFFENC_AC0_60</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE120</name>
              <description>Huffman code 120
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN120</name>
              <description>Huffman length 120
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE121</name>
              <description>Huffman code 121
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN121</name>
              <description>Huffman length 121
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_61</name>
          <displayName>JPEG_HUFFENC_AC0_61</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE122</name>
              <description>Huffman code 122
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN122</name>
              <description>Huffman length 122
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE123</name>
              <description>Huffman code 123
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN123</name>
              <description>Huffman length 123
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_AC0_62</name>
          <displayName>JPEG_HUFFENC_AC0_62</displayName>
          <description>JPEG Huffman encoder AC0</description>
          <addressOffset>0x5F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE124</name>
              <description>Huffman code 124
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN124</name>
              <description>Huffman length 124
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE125</name>
              <description>Huffman code 125
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN125</name>
              <description>Huffman length 125
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
