zuyih/platform-ststm32/misc/svd/STM32H5E5.svd
        <register>
          <name>JPEG_HUFFENC_AC1_87</name>
          <displayName>JPEG_HUFFENC_AC1_87</displayName>
          <description>JPEG Huffman encoder AC1</description>
          <addressOffset>0x7BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE174</name>
              <description>Huffman code 174
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN174</name>
              <description>Huffman length 174
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE175</name>
              <description>Huffman code 175
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN175</name>
              <description>Huffman length 175
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_0</name>
          <displayName>JPEG_HUFFENC_DC0_0</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_1</name>
          <displayName>JPEG_HUFFENC_DC0_1</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE2</name>
              <description>Huffman code 2
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN2</name>
              <description>Huffman length 2
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE3</name>
              <description>Huffman code 3
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN3</name>
              <description>Huffman length 3
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_2</name>
          <displayName>JPEG_HUFFENC_DC0_2</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE4</name>
              <description>Huffman code 4
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN4</name>
              <description>Huffman length 4
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE5</name>
              <description>Huffman code 5
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN5</name>
              <description>Huffman length 5
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_3</name>
          <displayName>JPEG_HUFFENC_DC0_3</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE6</name>
              <description>Huffman code 6
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN6</name>
              <description>Huffman length 6
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE7</name>
              <description>Huffman code 7
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN7</name>
              <description>Huffman length 7
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_4</name>
          <displayName>JPEG_HUFFENC_DC0_4</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE8</name>
              <description>Huffman code 8
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN8</name>
              <description>Huffman length 8
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE9</name>
              <description>Huffman code 9
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN9</name>
              <description>Huffman length 9
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_5</name>
          <displayName>JPEG_HUFFENC_DC0_5</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE10</name>
              <description>Huffman code 10
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN10</name>
              <description>Huffman length 10
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE11</name>
              <description>Huffman code 11
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN11</name>
              <description>Huffman length 11
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_6</name>
          <displayName>JPEG_HUFFENC_DC0_6</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE12</name>
              <description>Huffman code 12
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN12</name>
              <description>Huffman length 12
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE13</name>
              <description>Huffman code 13
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN13</name>
              <description>Huffman length 13
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC0_7</name>
          <displayName>JPEG_HUFFENC_DC0_7</displayName>
          <description>JPEG Huffman encoder DC0</description>
          <addressOffset>0x7DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE14</name>
              <description>Huffman code 14
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN14</name>
              <description>Huffman length 14
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE15</name>
              <description>Huffman code 15
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN15</name>
              <description>Huffman length 15
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_0</name>
          <displayName>JPEG_HUFFENC_DC1_0</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_1</name>
          <displayName>JPEG_HUFFENC_DC1_1</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE2</name>
              <description>Huffman code 2
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN2</name>
              <description>Huffman length 2
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE3</name>
              <description>Huffman code 3
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN3</name>
              <description>Huffman length 3
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_2</name>
          <displayName>JPEG_HUFFENC_DC1_2</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE4</name>
              <description>Huffman code 4
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN4</name>
              <description>Huffman length 4
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE5</name>
              <description>Huffman code 5
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN5</name>
              <description>Huffman length 5
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_3</name>
          <displayName>JPEG_HUFFENC_DC1_3</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE6</name>
              <description>Huffman code 6
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN6</name>
              <description>Huffman length 6
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE7</name>
              <description>Huffman code 7
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN7</name>
              <description>Huffman length 7
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_4</name>
          <displayName>JPEG_HUFFENC_DC1_4</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE8</name>
              <description>Huffman code 8
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN8</name>
              <description>Huffman length 8
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE9</name>
              <description>Huffman code 9
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN9</name>
              <description>Huffman length 9
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_5</name>
          <displayName>JPEG_HUFFENC_DC1_5</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE10</name>
              <description>Huffman code 10
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN10</name>
              <description>Huffman length 10
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE11</name>
              <description>Huffman code 11
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN11</name>
              <description>Huffman length 11
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_HUFFENC_DC1_6</name>
          <displayName>JPEG_HUFFENC_DC1_6</displayName>
          <description>JPEG Huffman encoder DC1</description>
          <addressOffset>0x7F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE12</name>
              <description>Huffman code 12
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN12</name>
              <description>Huffman length 12
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE13</name>
              <description>Huffman code 13
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN13</name>
              <description>Huffman length 13
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
