zuyih/platform-ststm32/misc/svd/STM32H5E5.svd
                  <description>SRAM3 clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_AHB4LPENR</name>
          <displayName>RCC_AHB4LPENR</displayName>
          <description>RCC AHB4 sleep clock register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTFDEC1LPEN</name>
              <description>OTFDEC1 clock enable during Sleep mode
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OTFDEC1 clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OTFDEC1 clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTFDEC2LPEN</name>
              <description>OTFDEC2 clock enable during Sleep mode
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OTFDEC2 clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OTFDEC2 clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC1LPEN</name>
              <description>SDMMC1 and SDMMC1 delay clock enable during Sleep mode
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SDMMC1 and SDMMC1 delay clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SDMMC1 and SDMMC1 delay clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC2LPEN</name>
              <description>SDMMC2 and SDMMC2 delay clock enable during Sleep mode
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SDMMC2 and SDMMC2 delay clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SDMMC2 and SDMMC2 delay clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMCLPEN</name>
              <description>FMC clock enable during Sleep mode
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>FMC clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>FMC clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPI1LPEN</name>
              <description>OCTOSPI1 clock enable during Sleep mode
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OCTOSPI1 clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OCTOSPI1 clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPI2LPEN</name>
              <description>OCTOSPI2 clock enable during Sleep mode
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OCTOSPI2 clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OCTOSPI2 clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPIMLPEN</name>
              <description>OCTOSPIM clock enable during Sleep mode
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>OCTOSPIM clock disabled during Sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>OCTOSPIM clock enabled during Sleep mode (default after reset)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
